app/Controllers/Articles.php

    public function index()
    {
        // $db = \Config\Database::connect();
        // try {
        //     if ($db->connect()) {
        //         echo "Database connection successful.";
        //     }
        // } catch (DatabaseException $e) {
        //     echo "Database connection failed: " . $e->getMessage();
        // }
        // $db->listTables();

        // $data =[
        //         ["title" => "One", "content" => "The First"],
        //         ["title" => "Two", "content" => "the Second"],
        //         ["title" => "Three", "content" => "the Third"],
        //     ];

        $model = new ArticleModel();
        $data = $model->findAll();
---
SELECT *
FROM `article`

    public function show($id)
    {
        // dd($id);
        $model = new ArticleModel();
        $article = $model->find($id);
---
SELECT *
FROM `article`
WHERE `article`.`id` = '1'